tutorials/overset/flowTests/navyCylinderSheddingTest/bodyFittedCylinderCircular/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application icoOversetFoam;

// startFrom       startTime;
startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         100;

deltaT          0.02;

writeControl    runTime;

writeInterval   2;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression compressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

libs
(
    "libfoam.so"
    "libmeshTools.so"
    "libsurfMesh.so"
    "libsampling.so"
    "libdynamicMesh.so"
    "liboversetMesh.so"
);



functions
(
    forces
    {
        type                forces;
        functionObjectLibs  ( "libforces.so" );
        outputControl       timeStep;
        outputInterval      1;
        patches             ( cylinder );
        pName               p;
        UName               U;
        rhoName             rhoInf;
        log                 true;
        rhoInf              1;
        CofR                (0 0 0);
    }

    probes
    {
        type            probes;
        functionObjectLibs ("libsampling.so");
        enabled         true;
        outputControl   timeStep;
        outputInterval  1;
        probeLocations
        (
            ( 1 0 0 )
            ( 3 0 0 )
            ( 5 0 0 )
        );

        fields
        (
            p
        );
    }
);


// ************************************************************************* //
